const CONFIG = {
    SCRIPT_URL: "https://script.google.com/macros/s/AKfycbyBRu56yCh-x7EL-OQkEe_Lcb-En6Efj94e8yzKD1OlyHfaRDLId3dovUSt362l7qRK/exec",
    LOGO_FILENAME: "logo.jpg", // וודא שזה שם הקובץ האיכותי שלך
    SUPPORT_PHONE: "0539653809"
};

const PARASHOT_DB = {
    // 2025
    "2025-01-04": "ויגש", "2025-01-11": "ויחי", "2025-01-18": "שמות", "2025-01-25": "וארא",
    "2025-02-01": "בא", "2025-02-08": "בשלח", "2025-02-15": "יתרו", "2025-02-22": "משפטים",
    "2025-03-01": "תרומה", "2025-03-08": "תצוה", "2025-03-15": "כי תשא", "2025-03-22": "ויקהל-פקודי", "2025-03-29": "ויקרא",
    "2025-04-05": "צו", "2025-04-12": "ערב פסח", "2025-04-19": "חוה\"מ פסח", "2025-04-26": "שמיני",
    "2025-05-03": "תזריע-מצורע", "2025-05-10": "אחרי מות-קדושים", "2025-05-17": "אמור", "2025-05-24": "בהר-בחוקותי", "2025-05-31": "במדבר",
    "2025-06-07": "נשא", "2025-06-14": "בהעלותך", "2025-06-21": "שלח", "2025-06-28": "קרח",
    "2025-07-05": "חקת", "2025-07-12": "בלק", "2025-07-19": "פינחס", "2025-07-26": "מטות-מסעי",
    "2025-08-02": "דברים", "2025-08-09": "ואתחנן", "2025-08-16": "עקב", "2025-08-23": "ראה", "2025-08-30": "שופטים",
    "2025-09-06": "כי תצא", "2025-09-13": "כי תבוא", "2025-09-20": "נצבים", "2025-09-27": "וילך",
    "2025-10-04": "האזינו", "2025-10-11": "חוה\"מ סוכות", "2025-10-18": "בראשית", "2025-10-25": "נח",
    "2025-11-01": "לך לך", "2025-11-08": "וירא", "2025-11-15": "חיי שרה", "2025-11-22": "תולדות", "2025-11-29": "ויצא",
    "2025-12-06": "וישלח", "2025-12-13": "וישב", "2025-12-20": "מקץ", "2025-12-27": "ויגש",
    // 2026
    "2026-01-03": "ויחי", "2026-01-10": "שמות", "2026-01-17": "וארא", "2026-01-24": "בא", "2026-01-31": "בשלח",
    "2026-03-14": "ויקהל-פקודי", "2026-04-04": "חוה\"מ פסח", "2026-05-09": "בהר-בחוקותי", "2026-09-12": "ערב רה\"ש", "2026-09-26": "ערב סוכות",
    // 2027
    "2027-04-24": "חוה\"מ פסח", "2027-10-02": "נצבים-וילך", "2027-10-16": "סוכות"
};
